In [1]:
import numpy as np
import pandas as pd

In [11]:
data = {
    'A':[1,2,np.nan,4,5],
    'B':[1,2,3,4,5],
    'C':[1,2,3,np.nan,np.nan],
    'D':[1,np.nan,np.nan,np.nan,5]
}
df = pd.DataFrame(data)

In [12]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [13]:
df.isna() #checks if the value is nan and if no then it is false

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [14]:
df.isna().sum() # Gives the total number of nan in a column

A    1
B    0
C    2
D    3
dtype: int64

In [15]:
df.isna().any() #checks if the colmns has a nan

A     True
B    False
C     True
D     True
dtype: bool

In [16]:
df.dropna() #Remove the rows containing nan

     A  B    C    D
0  1.0  1  1.0  1.0

In [17]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [18]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [19]:
df.dropna(thresh=4) #Returns row with numbers equal to 4 numbers

     A  B    C    D
0  1.0  1  1.0  1.0

In [20]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [22]:
values = {'A':0,'B':600,'C':900,'D':700}
df.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  700.0
2  0.0  3    3.0  700.0
3  4.0  4  900.0  700.0
4  5.0  5  900.0    5.0